# coding=gbk
from model import DCGAN
from utils import data_gen


#---------------------------------设置参数-------------------------------------
batch_size = 128            # 训练批次大小
epochs = 50                 # 训练轮数
steps_per_epoch = 100       # 每轮训练的步数
#-----------------------------------------------------------------------------


#---------------------------------设置路径-------------------------------------
data_path = "D:/科研/python代码/炼丹手册/DCGAN/datasets/"
save_path = "D:/科研/python代码/炼丹手册/DCGAN/save_models/"
#-----------------------------------------------------------------------------


#--------------------------------加载数据集-------------------------------------
generator = data_gen(
    data_path,
    batch_size=batch_size,
    target_size=(64, 64),
    seed=10)
#-----------------------------------------------------------------------------


#---------------------------------搭建模型-------------------------------------
dcgan = DCGAN()
dcgan.generator.summary()
dcgan.discriminator.summary()
#-----------------------------------------------------------------------------


#--------------------------------训练和保存-------------------------------------
dcgan.fit(
    data_generator=generator,
    epochs=epochs,
    batch_size=batch_size, 
    steps_per_epoch = steps_per_epoch
    )
dcgan.save_weights(save_path)
#-----------------------------------------------------------------------------